[
    {
        "id": 1,
        "title": "Umpqua River Cleanup",
        "date": "2025-08-15",
        "location": "Stewart Park, Roseburg, OR",
        "image": "river-cleanup.webp",
        "impact": "Help clean 2 miles of riverbank to protect local wildlife.",
        "skills": "Teamwork, Outdoor Work",
        "description": "Join us for a rewarding morning at Stewart Park along the scenic Umpqua River, where we'll work together to remove debris, trash, and invasive plants to protect the local ecosystem. This event is perfect for nature lovers and community enthusiasts alike. Please bring your own gloves, wear sturdy shoes, and stay hydrated with water. We'll provide trash bags and guidance, and you'll leave knowing you've made a tangible difference for Roseburg's wildlife and water quality.",
        "time": "9:00 AM - 12:00 PM",
        "contact": "rivercleanup@roseburgvolunteers.org"
    },
    {
        "id": 2,
        "title": "Youth Tutoring Program",
        "date": "2025-09-10",
        "location": "Roseburg Library, OR",
        "image": "tutoring.webp",
        "impact": "Support 50+ students with homework and reading skills.",
        "skills": "Teaching, Teamwork",
        "description": "Spend an afternoon at the Roseburg Library helping local students with homework, reading, and learning activities in a warm, supportive environment. No prior teaching experience is required—just a willingness to assist and encourage! We'll pair you with kids based on your interests, and you'll receive a brief orientation. Bring your enthusiasm and a smile, and help shape the future of our community's youth while enjoying a fulfilling volunteer experience.",
        "time": "3:00 PM - 5:00 PM",
        "contact": "tutoring@roseburgvolunteers.org"
    },
    {
        "id": 3,
        "title": "Community Garden Planting",
        "date": "2025-10-05",
        "location": "Fir Grove Park, Roseburg, OR",
        "image": "garden.webp",
        "impact": "Plant 100+ vegetables for local food banks.",
        "skills": "Gardening, Teamwork",
        "description": "Come to Fir Grove Park to plant over 100 vegetable seedlings, including tomatoes, carrots, and lettuce, which will be donated to local food banks to support Roseburg families. This is a great opportunity for gardening enthusiasts or beginners to get hands-on experience. We'll supply all tools, seeds, and expert guidance, and you'll enjoy a morning of fresh air and community bonding while contributing to food security in our area.",
        "time": "10:00 AM - 1:00 PM",
        "contact": "garden@roseburgvolunteers.org"
    },
    {
        "id": 4,
        "title": "Douglas County Fair Support",
        "date": "2025-08-20",
        "location": "Douglas County Fairgrounds, Roseburg, OR",
        "image": "fair-support.webp",
        "impact": "Assist with setup and activities for 5,000+ attendees.",
        "skills": "Teamwork, Outdoor Work",
        "description": "Be part of the excitement at the Douglas County Fairgrounds by helping with setup, event assistance, and cleanup for an anticipated 5,000+ visitors. Tasks include arranging booths, guiding attendees, and ensuring a smooth event flow. This energetic role is ideal for those who love fairs and community gatherings. Wear comfortable clothing and shoes, and bring your enthusiasm—we'll provide training and a fun atmosphere to make memories!",
        "time": "8:00 AM - 4:00 PM",
        "contact": "fair@roseburgvolunteers.org"
    },
    {
        "id": 5,
        "title": "Roseburg Food Bank Drive",
        "date": "2025-09-15",
        "location": "Roseburg Community Center, OR",
        "image": "food-drive.webp",
        "impact": "Collect 1,000+ lbs of food for families in need.",
        "skills": "Teamwork, Community",
        "description": "Join us at the Roseburg Community Center to collect, sort, and distribute over 1,000 pounds of food donations to support local families in need. This event welcomes all skill levels—whether you're organizing donations, packing boxes, or chatting with donors, your help matters. We'll provide gloves and guidance, and you'll leave with the satisfaction of directly impacting hunger relief in our community.",
        "time": "9:00 AM - 2:00 PM",
        "contact": "foodbank@roseburgvolunteers.org"
    },
    {
        "id": 6,
        "title": "Senior Center Visit",
        "date": "2025-10-12",
        "location": "Roseburg Senior Center, OR",
        "image": "senior-visit.webp",
        "impact": "Brighten the day for 30+ seniors with activities.",
        "skills": "Community, Teaching",
        "description": "Spend a heartwarming afternoon at the Roseburg Senior Center engaging with over 30 seniors through games, conversation, and light activities. This role is perfect for those with a warm personality—no teaching skills needed, just a desire to connect. We'll provide activity ideas and a welcoming space, ensuring you leave with new friendships and the joy of making a senior's day brighter.",
        "time": "1:00 PM - 3:00 PM",
        "contact": "senior@roseburgvolunteers.org"
    },
    {
        "id": 7,
        "title": "Park Trail Maintenance",
        "date": "2025-08-25",
        "location": "Riversdale Park, Roseburg, OR",
        "image": "trail-maintenance.webp",
        "impact": "Maintain 3 miles of trails for community use.",
        "skills": "Outdoor Work, Teamwork",
        "description": "Help maintain 3 miles of trails at Riversdale Park by clearing debris, trimming overgrown areas, and ensuring safety for hikers and families. This outdoor event requires sturdy shoes and a willingness to work as a team. We'll supply tools and safety gear, and you'll enjoy a morning of exercise while preserving Roseburg's natural spaces for everyone to enjoy.",
        "time": "8:00 AM - 11:00 AM",
        "contact": "trails@roseburgvolunteers.org"
    },
    {
        "id": 8,
        "title": "Library Book Sale",
        "date": "2025-09-20",
        "location": "Roseburg Library, OR",
        "image": "book-sale.webp",
        "impact": "Raise $500 for library programs through book sales.",
        "skills": "Teamwork, Community",
        "description": "Assist at the Roseburg Library book sale by organizing books, setting up displays, and helping customers, all to raise funds for library programs. Ideal for book lovers or those who enjoy organizing, this event offers a chance to browse books while contributing. We'll provide tables and guidance, and you'll help support literacy in our community.",
        "time": "10:00 AM - 2:00 PM",
        "contact": "library@roseburgvolunteers.org"
    },
    {
        "id": 9,
        "title": "Tree Planting Day",
        "date": "2025-10-18",
        "location": "Stewart Park, Roseburg, OR",
        "image": "tree-planting.webp",
        "impact": "Plant 50 trees to enhance local greenery.",
        "skills": "Gardening, Outdoor Work",
        "description": "Join us at Stewart Park to plant 50 trees, including native species, to boost Roseburg's greenery and combat climate change. This event is perfect for gardening novices and experts alike—we'll provide shovels, trees, and expert tips. Wear comfortable clothing and enjoy a morning of learning and contributing to a greener future.",
        "time": "9:00 AM - 12:00 PM",
        "contact": "trees@roseburgvolunteers.org"
    },
    {
        "id": 10,
        "title": "Community Festival Help",
        "date": "2025-08-30",
        "location": "Downtown Roseburg, OR",
        "image": "festival-help.webp",
        "impact": "Support 1,000+ attendees at a local cultural event.",
        "skills": "Teamwork, Community",
        "description": "Get involved in Downtown Roseburg's cultural festival by assisting with setup, managing food stalls, and cleanup for over 1,000 attendees. This lively event is great for those who enjoy meeting people and working in a festive atmosphere. We'll provide training and supplies, and you'll help celebrate our community's heritage.",
        "time": "11:00 AM - 5:00 PM",
        "contact": "festival@roseburgvolunteers.org"
    },
    {
        "id": 11,
        "title": "Recycling Drive",
        "date": "2025-09-25",
        "location": "Roseburg High School, OR",
        "image": "recycling-drive.webp",
        "impact": "Recycle 500+ lbs of materials for sustainability.",
        "skills": "Outdoor Work, Teamwork",
        "description": "Help at Roseburg High School to sort, process, and recycle over 500 pounds of materials, promoting sustainability in our community. This hands-on event includes guidance on sorting techniques, and we'll supply gloves and bins. Bring your eco-friendly spirit and contribute to a cleaner Roseburg!",
        "time": "10:00 AM - 1:00 PM",
        "contact": "recycle@roseburgvolunteers.org"
    },
    {
        "id": 12,
        "title": "Youth Sports Coaching",
        "date": "2025-10-20",
        "location": "Roseburg Sports Complex, OR",
        "image": "sports-coaching.webp",
        "impact": "Coach 20+ kids in community sports programs.",
        "skills": "Teaching, Teamwork",
        "description": "Coach kids aged 6-12 in soccer or basketball at the Roseburg Sports Complex, fostering teamwork and fun. No coaching experience needed—just bring enthusiasm and a willingness to guide. We'll provide basic training and equipment, ensuring a rewarding afternoon of building confidence in our youth.",
        "time": "2:00 PM - 4:00 PM",
        "contact": "sports@roseburgvolunteers.org"
    },
    {
        "id": 13,
        "title": "Holiday Food Distribution",
        "date": "2025-11-15",
        "location": "Roseburg Community Center, OR",
        "image": "food-distribution.webp",
        "impact": "Distribute 2,000+ meals to families in need.",
        "skills": "Community, Teamwork",
        "description": "Join us at the Roseburg Community Center to pack and distribute over 2,000 holiday meals to families in need, spreading joy during the season. This heartwarming event involves teamwork to organize food boxes and assist recipients. We'll provide all materials, and you'll leave with the warmth of community giving.",
        "time": "9:00 AM - 3:00 PM",
        "contact": "holiday@roseburgvolunteers.org"
    },
    {
        "id": 14,
        "title": "Park Cleanup Day",
        "date": "2025-09-05",
        "location": "Fir Grove Park, Roseburg, OR",
        "image": "park-cleanup.webp",
        "impact": "Clean 5 acres of parkland for public enjoyment.",
        "skills": "Outdoor Work, Teamwork",
        "description": "Help clean 5 acres at Fir Grove Park by removing litter, trimming bushes, and enhancing beauty for public use. This outdoor event is ideal for those who love nature and teamwork. We'll supply trash bags and tools, so bring water and wear comfortable shoes for a productive morning.",
        "time": "8:00 AM - 11:00 AM",
        "contact": "park@roseburgvolunteers.org"
    },
    {
        "id": 15,
        "title": "Art Workshop Support",
        "date": "2025-10-25",
        "location": "Roseburg Arts Center, OR",
        "image": "art-workshop.webp",
        "impact": "Assist 40+ participants in a community art event.",
        "skills": "Community, Teaching",
        "description": "Support a creative art workshop at the Roseburg Arts Center, helping 40+ participants with supplies, guidance, and encouragement. This role is perfect for art lovers or those who enjoy teaching basics. We'll provide all materials and a fun environment, ensuring a memorable day of community creativity.",
        "time": "1:00 PM - 4:00 PM",
        "contact": "art@roseburgvolunteers.org"
    }
]